Repository: Zverik/quick_bus
Catalog: lib/l10n/app_*.arb
Languages: et, ru

source: Loading stops...
et: Peatuste laadimine...
ru: Загружаю остановки...

# acquiringLocation
source: Finding you...
et: Teie leidmine...
ru: Ищу вас...

source: My Location
et: Minu asukoht
ru: Моя позиция

# next
source: next {time}
et: järgmine {time}
ru: затем {time}

source: Search...
et: Otsing
ru: Найти...

# chooseOnMap
source: Choose on a map...
et: Valida kaardil...
ru: Указать на карте...

# showMap
source: Map
et: Kaart
ru: Карта

source: Where to?
et: Kuhu sõidame?
ru: Куда едем?

source: New Destination
et: Uus suund
ru: Новый пункт назначения

# lookingForRoute
source: Looking for a route...
et: Otsin marsruuti...
ru: Ищу варианты поездок...

# noRoutes
source: No routes found, sorry.
et: Vabandust, marsruute ei leitud.
ru: Нет вариантов, извините.

# locationNotAccessible
source: Cannot find a route to the destination.
et: Sellise suunaga marsruute ei leitud.
ru: Не построить маршрут до этой точки.

# showStopNames
source: Stop names
et: Peatuste nimed
ru: Названия остановок

# loadingRoute
source: Loading the route...
et: Marsruudi laadimine...
ru: Загружаю маршрут...

# errorLoadingRoute
source: Error loading route: {message}.
et: Marsruudi laadimisel tekkis viga: {message}.
ru: Ошибка загрузки маршрута: {message}.

# minutes
source: {value} min
ru: {value} мин

# fullMinutes
source: {value,plural, =1{{value} minute}, =few{{value} minutes}, =other{{value} minutes}}
et: {value,plural, =1{{value} minut}, =few{{value} minutit}, =other{{value} minutit}}
ru: {value,plural, =1{{value} минута}, =few{{value} минуты}, =other{{value} минут}}

source: Walk {min}
et: Jalutage {min}
ru: Пешком {min}

# arrivesText
source: {bus} to {headsign} arrives {when}
et: {bus} suunaga <b>{headsign}</b> saabub {when}
ru: {bus} на {headsign} прибывает {when}

# storePlan
source: Save route plan
et: Salvesta marsruut
ru: Сохранить маршрут

# restorePlan
source: Stored route plan
et: Marsruut salvestatud
ru: Сохранённый маршрут

# busLeavesFrom
source: {bus} leaves at {time} from {stop}
et: {bus} väljub kell {time} peatusest {stop}
ru: {bus} идёт в {time} от {stop}

# walkMeters
source: Walk {distance} m to <b>{destination}</b> (the yellow circle).
et: Jalutage {distance}m <b>{destination}</b> (kollane ring).
ru: Пройдите {distance} м до <b>{destination}</b> (жёлтый кружок).

# walkDestination
source: destination
et: suund
ru: точки назначения

# youGotTime
source: You've got {minutes}.
et: Teil on {minutes}.
ru: У вас {minutes}.

# noHurry
source: Don't hurry, you've got {minutes}.
et: Ärge kiirustage, teil on veel {minutes}.
ru: Не спешите, у вас {minutes}.

# stops
source: {stops,plural, =1{{stops} stop}, =few{{stops} stops}, =other{{stops} stops}}
et: {stops,plural, =1{{stops} peatus}, =other{{stops} peatust}}
ru: {stops,plural, =1{{stops} остановку}, =few{{stops} остановки}, =other{{stops} остановок}}

# waitAndRideStops
source: Wait for {min} and ride {stops} to <b>{destination}</b>.
et: Oodake {min} ja sõitke {stops} peatuseni <b>{destination}</b>.
ru: Подождите {min} и езжайте {stops} до <b>{destination}</b>.

# rideStops
source: Ride {stops} to <b>{destination}</b>.
et: Sõitke {stops} peatuseni <b>{destination}</b>.
ru: Езжайте {stops} до <b>{destination}</b>.

# waitAndRideTime
source: Wait {min} and ride until {arrival} to <b>{destination}</b>.
et: Oodake {min} ja sõida kuni kella {arrival} peatuseni <b>{destination}</b>.
ru: Подождите {min} и езжайте до <b>{destination}</b>, прибытие в {arrival}.

# rideTime
source: Ride until {arrival} to <b>{destination}</b>.
et: Sõida kuni kella {arrival} peatuseni <b>{destination}</b>.
ru: Езжайте до <b>{destination}</b>, прибытие в {arrival}.

# noStopsNearby
source: Please find a stop or move the map to see arrival times.
et: Saabumisaegade vaatamiseks tulge peatusele lähemale või lohistage kaarti.
ru: Подойдите к остановке или передвиньте карту, чтобы посмотреть расписание.

# noArrivals
source: No arrivals today.
et: Täna pole saabumisi.
ru: Сегодня никто не приедет.

# arrivalsError
source: Could not update arrivals.
et: Saabumise ajakava ei saanud värskendada.
ru: Не удалось загрузить расписание.

# bookmarkTarget
source: Drag here to set starting location
et: Lohistage siia, et alustada salvestatud kohast
ru: Перетащите сюда, чтобы начать из сохранённого места

source: Add Bookmark
et: Lisage järjehoidja
ru: Добавить закладку

source: Bookmark name
et: Järjehoidja nimi
ru: Название

# chooseEmoji
source: Choose an emoji
et: Valige emotikon
ru: Выберите значок

# deleteBookmark
source: Delete bookmark "{name}"?
et: Kas kustutada järjehoidja "{name}"?
ru: Удалить закладку "{name}"?

source: Reverse route
et: Vastupidine marsruut
ru: Маршрут в другую сторону

source: Route back
et: Marsruut tagasi
ru: Обратный маршрут

source: Delete
et: Kustutada
ru: Удалить

# enableInternet
source: Please turn on network access, otherwise I cannot get route data.
et: Palun lülitage võrgule juurdepääs sisse, muidu ei saa ma marsruudi andmeid kätte.
ru: Пожалуйста, включите интернет, чтобы можно было скачать маршруты.

source: Enable GPS
et: GPS lubamine
ru: Включите GPS

# enableGPSMessage
source: Please turn on the location services in the settings panel that will be shown.
et: Lülitage kuvataval seadete paneelil asukohateenused sisse.
ru: Сейчас откроем панель настроек — включите в ней определение местоположения, пожалуйста.

source: Enable Location
et: Luba asukoht
ru: Разрешите GPS

# enableLocationMessage
source: Please allow location access for the app in the settings panel that will be shown.
et: Lubage kuvataval seadete paneelil rakendusele juurdepääs asukohale.
ru: Сейчас откроем панель настроек — разрешите в ней доступ к местоположению, пожалуйста.

source: Bus
et: Buss
ru: Автобус

source: Trolleybus
et: Troll
ru: Троллейбус

source: Tram
et: Tramm
ru: Трамвай

source: Subway
et: Metroo
ru: Метро

source: Train
et: Rong
ru: Поезд

source: Ferry
et: Praam
ru: Паром

source: Regional Bus
et: Kaugliinibuss
ru: Региональный автобус

source: Commercial Bus
et: Kommertsbuss
ru: Коммерческий автобус

# openTutorial
source: Open the tutorial
et: Ava juhised
ru: Открыть инструкцию

# tMainScreen
source: Main Screen
et: Põhiekraan
ru: Первый экран

# bMainScreen
source: Drag the map to choose a nearby stop, consult the arrival times for it, or tap any of the destination icons.
et: Lohistage kaarti, et valida lähedal asuv peatus, vaadake selle saabumisaegu või puudutage mis tahes sihtkoha ikooni.
ru: Сдвиньте карту, если выходите из другого места, затем посмотрите прибывающие автобусы или нажмите на один из значков пункта назначения.

# msMap
source: Map: your location and the nearest stop
et: Kaart: teie asukoht ja lähimad peatused
ru: Карта: начало маршрута и ближайшая остановка

# msDestination
source: Destination: bookmarks and search
et: Sihtkoht: järjehoidjad ja otsing
ru: Куда едем: закладки и поиск

# msArrivals
source: Arrivals for the chosen stop
et: Saabumised valitud peatusesse
ru: Список прибытий на ближайшую остановку

# tBookmarks
source: Bookmarks
et: Järjehoidjad
ru: Закладки

# bBookmarks
source: After choosing a familiar destination, save it by tapping the button. Choose an emoji and a name for your bookmark, to plan routes with a single tap.
et: Pärast tuttava sihtkoha valimist salvestage see, puudutades nuppu. Valige järjehoidjale emotikon ja nimi, et planeerida marsruute ühe puudutusega.
ru: Найдя место, куда будете ездить не раз, сохраните его, нажав "+". Выберите эмодзи и название для закладки, чтобы строить туда маршруты одним нажатием.

# tSaveThePlan
source: Save the Plan
et: Salvesta plaan
ru: Сохраните маршрут

# bSaveThePlan
source: Having chosen a route, tap the icon to pin it to the main screen, so that you know where to go after leaving a bus.
et: Pärast marsruudi valimist puudutage ikooni, et see põhiekraanile kinnitada, et saaksite pärast bussist lahkumist teada, kuhu minna.
ru: Выбрав маршрут к цели, нажмите на значок вверху, чтобы закрепить маршрут на главном экране и не потеряться на пересадках.

# tFriendRoute
source: Help a Friend
et: Aidake sõpra
ru: Помогите другу

# bFriendRoute
source: To plan a route for your friend towards you, build one to them as usual, and then tap the button to reverse it.
et: Sõbra jaoks marsruudi kavandamiseks ehitage neile marsruudile nagu tavaliselt ja seejärel puudutage selle ümberpööramiseks nuppu.
ru: Чтобы построить маршрут от сохранённой точки, подержите закладку и перетащите её на карту. Булавка — это ваше местоположение. Также можете построить маршрут к другу и затем развернуть его к себе.

# tutorialDone
source: Done
et: Valmis
ru: Закрыть
